# WallAMLostAdjustmentReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..WallAMLostAdjustmentReference Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Wall Analytical Model has lost its adjustment reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallAMLostAdjustmentReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallAMLostAdjustmentReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallAMLostAdjustmentReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace